
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7686814481)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-mSgUgYs3gnjTwdiG

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
null_resource.lambda_layer: Refreshing state... [id=3425650805935528323]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 1s [id=6b48ecc0b5ee5af0b1a66623d63b72253afdf934]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
aws_api_gateway_rest_api.api: Refreshing state... [id=o1e3qkz6f9]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=rwxfg3]
aws_api_gateway_method.method: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-POST-200]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-POST]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-o1e3qkz6f9-rwxfg3-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=suutve]
local_file.index_page: Refreshing state... [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ last_modified                  = "2023-10-01T10:29:02.000+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ source_code_hash               = "jHrjiGwuUY06vfQXZpa9VGa7gSuTUy3i+veidKXYOEU=" -> "utvZZJ0gL++TSbp06khXeV+UgRlbbI4ym3qYCB4fNBo="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer is tainted, so must be replaced
-/+ resource "null_resource" "lambda_layer" {
      ~ id = "3425650805935528323" -> (known after apply)
    }

Plan: 3 to add, 3 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

null_resource.lambda_layer: Destroying... [id=3425650805935528323]
null_resource.lambda_layer: Destruction complete after 0s
null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n\n        pip install virtualenv\n        virtualenv --python=/usr/bin/python3.8  test_lambda_layer\n        source python/bin/active\n        pip install -r api/requirements.txt -t python/lib/python3.8/site-pakages\n        ls test_lambda_layer\n        wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz\n        ./7zz python.zip test_lambda_layer\n        ./7zz l python.zip\n"]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
null_resource.lambda_layer (local-exec): Collecting virtualenv
null_resource.lambda_layer (local-exec):   Downloading virtualenv-20.25.0-py3-none-any.whl (3.8 MB)
null_resource.lambda_layer (local-exec): Collecting platformdirs<5,>=3.9.1
null_resource.lambda_layer (local-exec):   Downloading platformdirs-4.1.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting distlib<1,>=0.3.7
null_resource.lambda_layer (local-exec):   Downloading distlib-0.3.8-py2.py3-none-any.whl (468 kB)
null_resource.lambda_layer (local-exec): Collecting filelock<4,>=3.12.2
null_resource.lambda_layer (local-exec):   Downloading filelock-3.13.1-py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Installing collected packages: platformdirs, distlib, filelock, virtualenv
null_resource.lambda_layer (local-exec): Successfully installed distlib-0.3.8 filelock-3.13.1 platformdirs-4.1.0 virtualenv-20.25.0
null_resource.lambda_layer (local-exec): created virtual environment CPython3.8.10.final.0-64 in 2110ms
null_resource.lambda_layer (local-exec):   creator CPython3Posix(dest=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-mSgUgYs3gnjTwdiG/config/test_lambda_layer, clear=False, no_vcs_ignore=False, global=False)
null_resource.lambda_layer (local-exec):   seeder FromAppData(download=False, pip=bundle, setuptools=bundle, wheel=bundle, via=copy, app_data_dir=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-mSgUgYs3gnjTwdiG/.local/share/virtualenv)
null_resource.lambda_layer (local-exec):     added seed packages: pip==23.3.1, setuptools==69.0.2, wheel==0.42.0
null_resource.lambda_layer (local-exec):   activators BashActivator,CShellActivator,FishActivator,NushellActivator,PowerShellActivator,PythonActivator
null_resource.lambda_layer (local-exec): /bin/sh: 5: source: not found
null_resource.lambda_layer (local-exec): Collecting beautifulsoup4==4.9.1
null_resource.lambda_layer (local-exec):   Downloading beautifulsoup4-4.9.1-py3-none-any.whl (115 kB)
null_resource.lambda_layer (local-exec): Collecting certifi==2022.12.7
null_resource.lambda_layer (local-exec):   Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
null_resource.lambda_layer (local-exec): Collecting chardet==3.0.4
null_resource.lambda_layer (local-exec):   Downloading chardet-3.0.4-py2.py3-none-any.whl (133 kB)
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
null_resource.lambda_layer (local-exec): Collecting idna==2.10
null_resource.lambda_layer (local-exec):   Downloading idna-2.10-py2.py3-none-any.whl (58 kB)
null_resource.lambda_layer (local-exec): Collecting requests==2.31.0
null_resource.lambda_layer (local-exec):   Downloading requests-2.31.0-py3-none-any.whl (62 kB)
null_resource.lambda_layer (local-exec): Collecting soupsieve==2.0.1
null_resource.lambda_layer (local-exec):   Downloading soupsieve-2.0.1-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting zulip==0.8.2
null_resource.lambda_layer (local-exec):   Downloading zulip-0.8.2-py3-none-any.whl (273 kB)
null_resource.lambda_layer (local-exec): Collecting sentry-sdk==1.14.0
null_resource.lambda_layer (local-exec):   Downloading sentry_sdk-1.14.0-py2.py3-none-any.whl (178 kB)
aws_s3_bucket.website: Modifications complete after 7s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
null_resource.lambda_layer (local-exec): Collecting python-lambda==11.8.0
null_resource.lambda_layer (local-exec):   Downloading python_lambda-11.8.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting urllib3<3,>=1.21.1
null_resource.lambda_layer (local-exec):   Downloading urllib3-2.1.0-py3-none-any.whl (104 kB)
null_resource.lambda_layer (local-exec): Collecting charset-normalizer<4,>=2
null_resource.lambda_layer (local-exec):   Downloading charset_normalizer-3.3.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (141 kB)
null_resource.lambda_layer (local-exec): Collecting matrix-client
null_resource.lambda_layer (local-exec):   Downloading matrix_client-0.4.0-py2.py3-none-any.whl (43 kB)
null_resource.lambda_layer (local-exec): Collecting typing-extensions>=3.7
null_resource.lambda_layer (local-exec):   Downloading typing_extensions-4.9.0-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting click
null_resource.lambda_layer (local-exec):   Downloading click-8.1.7-py3-none-any.whl (97 kB)
null_resource.lambda_layer (local-exec): Collecting distro
null_resource.lambda_layer (local-exec):   Downloading distro-1.9.0-py3-none-any.whl (20 kB)
null_resource.lambda_layer (local-exec): Collecting boto3>=1.4.4
null_resource.lambda_layer (local-exec):   Downloading boto3-1.34.29-py3-none-any.whl (139 kB)
null_resource.lambda_layer (local-exec): Collecting PyYAML==5.1
null_resource.lambda_layer (local-exec):   Downloading PyYAML-5.1.tar.gz (274 kB)
null_resource.lambda_layer (local-exec): Collecting s3transfer<0.11.0,>=0.10.0
null_resource.lambda_layer (local-exec):   Downloading s3transfer-0.10.0-py3-none-any.whl (82 kB)
null_resource.lambda_layer (local-exec): Collecting jmespath<2.0.0,>=0.7.1
null_resource.lambda_layer (local-exec):   Downloading jmespath-1.0.1-py3-none-any.whl (20 kB)
null_resource.lambda_layer: Still creating... [10s elapsed]
null_resource.lambda_layer (local-exec): Collecting botocore<1.35.0,>=1.34.29
null_resource.lambda_layer (local-exec):   Downloading botocore-1.34.29-py3-none-any.whl (11.9 MB)
null_resource.lambda_layer (local-exec): Collecting python-dateutil<3.0.0,>=2.1
null_resource.lambda_layer (local-exec):   Downloading python_dateutil-2.8.2-py2.py3-none-any.whl (247 kB)
null_resource.lambda_layer (local-exec): Collecting six>=1.5
null_resource.lambda_layer (local-exec):   Downloading six-1.16.0-py2.py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Building wheels for collected packages: PyYAML
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): started
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): finished with status 'done'
null_resource.lambda_layer (local-exec):   Created wheel for PyYAML: filename=PyYAML-5.1-cp38-cp38-linux_x86_64.whl size=44072 sha256=646cf8969de8eb05f47df30f24a5967fd70b8d79ce82b08935db9b1d49f33ec0
null_resource.lambda_layer (local-exec):   Stored in directory: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-mSgUgYs3gnjTwdiG/.cache/pip/wheels/52/dd/2b/10ff8b0ac81b93946bb5fb9e6749bae2dac246506c8774e6cf
null_resource.lambda_layer (local-exec): Successfully built PyYAML
null_resource.lambda_layer (local-exec): ERROR: matrix-client 0.4.0 has requirement urllib3~=1.21, but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: botocore 1.34.29 has requirement urllib3<1.27,>=1.25.4; python_version < "3.10", but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: python-lambda 11.8.0 has requirement click==6.6, but you'll have click 8.1.7 which is incompatible.
null_resource.lambda_layer (local-exec): Installing collected packages: soupsieve, beautifulsoup4, certifi, chardet, idna, urllib3, charset-normalizer, requests, matrix-client, typing-extensions, click, distro, zulip, sentry-sdk, six, python-dateutil, jmespath, botocore, s3transfer, boto3, PyYAML, python-lambda
null_resource.lambda_layer (local-exec): Successfully installed PyYAML-5.1 beautifulsoup4-4.9.1 boto3-1.34.29 botocore-1.34.29 certifi-2022.12.7 chardet-3.0.4 charset-normalizer-3.3.2 click-8.1.7 distro-1.9.0 idna-2.10 jmespath-1.0.1 matrix-client-0.4.0 python-dateutil-2.8.2 python-lambda-11.8.0 requests-2.31.0 s3transfer-0.10.0 sentry-sdk-1.14.0 six-1.16.0 soupsieve-2.0.1 typing-extensions-4.9.0 urllib3-2.1.0 zulip-0.8.2
null_resource.lambda_layer: Still creating... [20s elapsed]
null_resource.lambda_layer (local-exec): bin
null_resource.lambda_layer (local-exec): lib
null_resource.lambda_layer (local-exec): pyvenv.cfg
null_resource.lambda_layer (local-exec): --2024-01-28 15:51:37--  https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz
null_resource.lambda_layer (local-exec): Resolving mongulu-files.s3.eu-central-1.amazonaws.com (mongulu-files.s3.eu-central-1.amazonaws.com)... 52.219.169.158, 52.219.169.26, 3.5.139.117, ...
null_resource.lambda_layer (local-exec): Connecting to mongulu-files.s3.eu-central-1.amazonaws.com (mongulu-files.s3.eu-central-1.amazonaws.com)|52.219.169.158|:443... connected.
null_resource.lambda_layer (local-exec): HTTP request sent, awaiting response...
null_resource.lambda_layer (local-exec): 200 OK
null_resource.lambda_layer (local-exec): Length: 2763304 (2.6M) [binary/octet-stream]
null_resource.lambda_layer (local-exec): Saving to: '7zz'

null_resource.lambda_layer (local-exec):      0K .......... .......... .......... .......... ..........  1%  185K 14s
null_resource.lambda_layer (local-exec):     50K .......... .......... .......... .......... ..........  3%  186K 14s
null_resource.lambda_layer (local-exec):    100K .......... .......... .......... .......... ..........  5%  185K 14s
null_resource.lambda_layer (local-exec):    150K .......... .......... .......... .......... ..........  7%  204K 13s
null_resource.lambda_layer (local-exec):    200K .......... .......... .......... .......... ..........  9%  244K 12s
null_resource.lambda_layer (local-exec):    250K .......... .......... .......... .......... .......... 11%  278K 11s
null_resource.lambda_layer (local-exec):    300K .......... .......... .......... .......... .......... 12%  278K 11s
null_resource.lambda_layer (local-exec):    350K .......... .......... .......... .......... .......... 14%  278K 10s
null_resource.lambda_layer (local-exec):    400K .......... .......... .......... .......... .......... 16%  278K 10s
null_resource.lambda_layer (local-exec):    450K .......... .......... .......... .......... .......... 18%  550K 9s
null_resource.lambda_layer (local-exec):    500K .......... .......... .......... .......... .......... 20%  279K 9s
null_resource.lambda_layer (local-exec):    550K .......... .......... .......... .......... .......... 22%  324K 8s
null_resource.lambda_layer (local-exec):    600K .......... .......... .......... .......... .......... 24%  431K 8s
null_resource.lambda_layer (local-exec):    650K .......... .......... .......... .......... .......... 25%  278K 8s
null_resource.lambda_layer (local-exec):    700K .......... .......... .......... .......... .......... 27%  539K 7s
null_resource.lambda_layer (local-exec):    750K .......... .......... .......... .......... .......... 29%  331K 7s
null_resource.lambda_layer (local-exec):    800K .......... .......... .......... .......... .......... 31%  432K 7s
null_resource.lambda_layer (local-exec):    850K .......... .......... .......... .......... .......... 33%  549K 6s
null_resource.lambda_layer (local-exec):    900K .......... .......... .......... .......... .......... 35%  281K 6s
null_resource.lambda_layer (local-exec):    950K .......... .......... .......... .......... .......... 37%  556K 6s
null_resource.lambda_layer (local-exec):   1000K .......... .......... .......... .......... .......... 38%  547K 6s
null_resource.lambda_layer (local-exec):   1050K .......... .......... .......... .......... .......... 40%  554K 5s
null_resource.lambda_layer (local-exec):   1100K .......... .......... .......... .......... .......... 42%  281K 5s
null_resource.lambda_layer (local-exec):   1150K .......... .......... .......... .......... .......... 44%  556K 5s
null_resource.lambda_layer (local-exec):   1200K .......... .......... .......... .......... .......... 46%  553K 5s
null_resource.lambda_layer (local-exec):   1250K .......... .......... .......... .......... .......... 48%  549K 4s
null_resource.lambda_layer (local-exec):   1300K .......... .......... .......... .......... .......... 50%  559K 4s
null_resource.lambda_layer (local-exec):   1350K .......... .......... .......... .......... .......... 51%  551K 4s
null_resource.lambda_layer (local-exec):   1400K .......... .......... .......... .......... .......... 53%  554K 4s
null_resource.lambda_layer (local-exec):   1450K .......... .......... .......... .......... .......... 55%  557K 4s
null_resource.lambda_layer (local-exec):   1500K .......... .......... .......... .......... .......... 57%  556K 3s
null_resource.lambda_layer (local-exec):   1550K .......... .......... .......... .......... .......... 59%  555K 3s
null_resource.lambda_layer (local-exec):   1600K .......... .......... .......... .......... .......... 61%  555K 3s
null_resource.lambda_layer (local-exec):   1650K .......... .......... .......... .......... .......... 62%  558K 3s
null_resource.lambda_layer (local-exec):   1700K .......... .......... .......... .......... .......... 64%  558K 3s
null_resource.lambda_layer (local-exec):   1750K .......... .......... .......... .......... .......... 66%  555K 2s
null_resource.lambda_layer (local-exec):   1800K .......... .......... .......... .......... .......... 68%  559K 2s
null_resource.lambda_layer (local-exec):   1850K .......... .......... .......... .......... .......... 70%  557K 2s
null_resource.lambda_layer (local-exec):   1900K .......... .......... .......... .......... .......... 72%  555K 2s
null_resource.lambda_layer (local-exec):   1950K .......... .......... .......... .......... .......... 74%  557K 2s
null_resource.lambda_layer (local-exec):   2000K .......... .......... .......... .......... .......... 75%  564K 2s
null_resource.lambda_layer (local-exec):   2050K .......... .......... .......... .......... .......... 77%  557K 2s
null_resource.lambda_layer (local-exec):   2100K .......... .......... .......... .......... .......... 79%  555K 1s
null_resource.lambda_layer (local-exec):   2150K .......... .......... .......... .......... .......... 81% 12.3M 1s
null_resource.lambda_layer (local-exec):   2200K .......... .......... .......... .......... .......... 83%  566K 1s
null_resource.lambda_layer (local-exec):   2250K .......... .......... .......... .......... .......... 85%  558K 1s
null_resource.lambda_layer (local-exec):   2300K .......... .......... .......... .......... .......... 87%  556K 1s
null_resource.lambda_layer (local-exec):   2350K .......... .......... .......... .......... .......... 88%  565K 1s
null_resource.lambda_layer (local-exec):   2400K .......... .......... .......... .......... .......... 90%  557K 1s
null_resource.lambda_layer (local-exec):   2450K .......... .......... .......... .......... .......... 92% 11.1M 0s
null_resource.lambda_layer (local-exec):   2500K .......... .......... .......... .......... .......... 94%  562K 0s
null_resource.lambda_layer: Still creating... [30s elapsed]
null_resource.lambda_layer (local-exec):   2550K .......... .......... .......... .......... .......... 96%  569K 0s
null_resource.lambda_layer (local-exec):   2600K .......... .......... .......... .......... .......... 98%  559K 0s
null_resource.lambda_layer (local-exec):   2650K .......... .......... .......... .......... ........  100% 10.5M=6.3s

null_resource.lambda_layer (local-exec): 2024-01-28 15:51:43 (428 KB/s) - '7zz' saved [2763304/2763304]


null_resource.lambda_layer (local-exec): 7-Zip (z) 23.01 (x64) : Copyright (c) 1999-2023 Igor Pavlov : 2023-06-20
null_resource.lambda_layer (local-exec):  64-bit locale=C.UTF-8 Threads:16 OPEN_MAX:1048576, ASM



null_resource.lambda_layer (local-exec): Command Line Error:
null_resource.lambda_layer (local-exec): Unsupported command:
null_resource.lambda_layer (local-exec): python.zip

null_resource.lambda_layer (local-exec): 7-Zip (z) 23.01 (x64) : Copyright (c) 1999-2023 Igor Pavlov : 2023-06-20
null_resource.lambda_layer (local-exec):  64-bit locale=C.UTF-8 Threads:16 OPEN_MAX:1048576, ASM

null_resource.lambda_layer (local-exec): Scanning the drive for archives:

null_resource.lambda_layer (local-exec): ERROR: errno=2 : No such file or directory
null_resource.lambda_layer (local-exec): python.zip



null_resource.lambda_layer (local-exec): System ERROR:
null_resource.lambda_layer (local-exec): errno=2 : No such file or directory
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.lambda_layer,
│   on main.tf line 167, in resource "null_resource" "lambda_layer":
│  167:   provisioner "local-exec" {
│ 
│ Error running command '        /bin/bash
│ 
│         pip install virtualenv
│         virtualenv --python=/usr/bin/python3.8  test_lambda_layer
│         source python/bin/active
│         pip install -r api/requirements.txt -t python/lib/python3.8/site-pakages
│         ls test_lambda_layer
│         wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz
│         ./7zz python.zip test_lambda_layer
│         ./7zz l python.zip
│ ': exit status 2. Output: .0-py3-none-any.whl (62 kB)
│ Collecting soupsieve==2.0.1
│   Downloading soupsieve-2.0.1-py3-none-any.whl (32 kB)
│ Collecting zulip==0.8.2
│   Downloading zulip-0.8.2-py3-none-any.whl (273 kB)
│ Collecting sentry-sdk==1.14.0
│   Downloading sentry_sdk-1.14.0-py2.py3-none-any.whl (178 kB)
│ Collecting python-lambda==11.8.0
│   Downloading python_lambda-11.8.0-py3-none-any.whl (17 kB)
│ Collecting urllib3<3,>=1.21.1
│   Downloading urllib3-2.1.0-py3-none-any.whl (104 kB)
│ Collecting charset-normalizer<4,>=2
│   Downloading charset_normalizer-3.3.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (141 kB)
│ Collecting matrix-client
│   Downloading matrix_client-0.4.0-py2.py3-none-any.whl (43 kB)
│ Collecting typing-extensions>=3.7
│   Downloading typing_extensions-4.9.0-py3-none-any.whl (32 kB)
│ Collecting click
│   Downloading click-8.1.7-py3-none-any.whl (97 kB)
│ Collecting distro
│   Downloading distro-1.9.0-py3-none-any.whl (20 kB)
│ Collecting boto3>=1.4.4
│   Downloading boto3-1.34.29-py3-none-any.whl (139 kB)
│ Collecting PyYAML==5.1
│   Downloading PyYAML-5.1.tar.gz (274 kB)
│ Collecting s3transfer<0.11.0,>=0.10.0
│   Downloading s3transfer-0.10.0-py3-none-any.whl (82 kB)
│ Collecting jmespath<2.0.0,>=0.7.1
│   Downloading jmespath-1.0.1-py3-none-any.whl (20 kB)
│ Collecting botocore<1.35.0,>=1.34.29
│   Downloading botocore-1.34.29-py3-none-any.whl (11.9 MB)
│ Collecting python-dateutil<3.0.0,>=2.1
│   Downloading python_dateutil-2.8.2-py2.py3-none-any.whl (247 kB)
│ Collecting six>=1.5
│   Downloading six-1.16.0-py2.py3-none-any.whl (11 kB)
│ Building wheels for collected packages: PyYAML
│   Building wheel for PyYAML (setup.py): started
│   Building wheel for PyYAML (setup.py): finished with status 'done'
│   Created wheel for PyYAML: filename=PyYAML-5.1-cp38-cp38-linux_x86_64.whl size=44072 sha256=646cf8969de8eb05f47df30f24a5967fd70b8d79ce82b08935db9b1d49f33ec0
│   Stored in directory: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-mSgUgYs3gnjTwdiG/.cache/pip/wheels/52/dd/2b/10ff8b0ac81b93946bb5fb9e6749bae2dac246506c8774e6cf
│ Successfully built PyYAML
│ ERROR: matrix-client 0.4.0 has requirement urllib3~=1.21, but you'll have
│ urllib3 2.1.0 which is incompatible.
│ ERROR: botocore 1.34.29 has requirement urllib3<1.27,>=1.25.4;
│ python_version < "3.10", but you'll have urllib3 2.1.0 which is
│ incompatible.
│ ERROR: python-lambda 11.8.0 has requirement click==6.6, but you'll have
│ click 8.1.7 which is incompatible.
│ Installing collected packages: soupsieve, beautifulsoup4, certifi, chardet,
│ idna, urllib3, charset-normalizer, requests, matrix-client,
│ typing-extensions, click, distro, zulip, sentry-sdk, six, python-dateutil,
│ jmespath, botocore, s3transfer, boto3, PyYAML, python-lambda
│ Successfully installed PyYAML-5.1 beautifulsoup4-4.9.1 boto3-1.34.29
│ botocore-1.34.29 certifi-2022.12.7 chardet-3.0.4 charset-normalizer-3.3.2
│ click-8.1.7 distro-1.9.0 idna-2.10 jmespath-1.0.1 matrix-client-0.4.0
│ python-dateutil-2.8.2 python-lambda-11.8.0 requests-2.31.0
│ s3transfer-0.10.0 sentry-sdk-1.14.0 six-1.16.0 soupsieve-2.0.1
│ typing-extensions-4.9.0 urllib3-2.1.0 zulip-0.8.2
│ bin
│ lib
│ pyvenv.cfg
│ --2024-01-28 15:51:37--
│ https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz
│ Resolving mongulu-files.s3.eu-central-1.amazonaws.com
│ (mongulu-files.s3.eu-central-1.amazonaws.com)... 52.219.169.158,
│ 52.219.169.26, 3.5.139.117, ...
│ Connecting to mongulu-files.s3.eu-central-1.amazonaws.com
│ (mongulu-files.s3.eu-central-1.amazonaws.com)|52.219.169.158|:443...
│ connected.
│ HTTP request sent, awaiting response... 200 OK
│ Length: 2763304 (2.6M) [binary/octet-stream]
│ Saving to: '7zz'
│ 
│      0K .......... .......... .......... .......... ..........  1%  185K 14s
│     50K .......... .......... .......... .......... ..........  3%  186K 14s
│    100K .......... .......... .......... .......... ..........  5%  185K 14s
│    150K .......... .......... .......... .......... ..........  7%  204K 13s
│    200K .......... .......... .......... .......... ..........  9%  244K 12s
│    250K .......... .......... .......... .......... .......... 11%  278K 11s
│    300K .......... .......... .......... .......... .......... 12%  278K 11s
│    350K .......... .......... .......... .......... .......... 14%  278K 10s
│    400K .......... .......... .......... .......... .......... 16%  278K 10s
│    450K .......... .......... .......... .......... .......... 18%  550K 9s
│    500K .......... .......... .......... .......... .......... 20%  279K 9s
│    550K .......... .......... .......... .......... .......... 22%  324K 8s
│    600K .......... .......... .......... .......... .......... 24%  431K 8s
│    650K .......... .......... .......... .......... .......... 25%  278K 8s
│    700K .......... .......... .......... .......... .......... 27%  539K 7s
│    750K .......... .......... .......... .......... .......... 29%  331K 7s
│    800K .......... .......... .......... .......... .......... 31%  432K 7s
│    850K .......... .......... .......... .......... .......... 33%  549K 6s
│    900K .......... .......... .......... .......... .......... 35%  281K 6s
│    950K .......... .......... .......... .......... .......... 37%  556K 6s
│   1000K .......... .......... .......... .......... .......... 38%  547K 6s
│   1050K .......... .......... .......... .......... .......... 40%  554K 5s
│   1100K .......... .......... .......... .......... .......... 42%  281K 5s
│   1150K .......... .......... .......... .......... .......... 44%  556K 5s
│   1200K .......... .......... .......... .......... .......... 46%  553K 5s
│   1250K .......... .......... .......... .......... .......... 48%  549K 4s
│   1300K .......... .......... .......... .......... .......... 50%  559K 4s
│   1350K .......... .......... .......... .......... .......... 51%  551K 4s
│   1400K .......... .......... .......... .......... .......... 53%  554K 4s
│   1450K .......... .......... .......... .......... .......... 55%  557K 4s
│   1500K .......... .......... .......... .......... .......... 57%  556K 3s
│   1550K .......... .......... .......... .......... .......... 59%  555K 3s
│   1600K .......... .......... .......... .......... .......... 61%  555K 3s
│   1650K .......... .......... .......... .......... .......... 62%  558K 3s
│   1700K .......... .......... .......... .......... .......... 64%  558K 3s
│   1750K .......... .......... .......... .......... .......... 66%  555K 2s
│   1800K .......... .......... .......... .......... .......... 68%  559K 2s
│   1850K .......... .......... .......... .......... .......... 70%  557K 2s
│   1900K .......... .......... .......... .......... .......... 72%  555K 2s
│   1950K .......... .......... .......... .......... .......... 74%  557K 2s
│   2000K .......... .......... .......... .......... .......... 75%  564K 2s
│   2050K .......... .......... .......... .......... .......... 77%  557K 2s
│   2100K .......... .......... .......... .......... .......... 79%  555K 1s
│   2150K .......... .......... .......... .......... .......... 81% 12.3M 1s
│   2200K .......... .......... .......... .......... .......... 83%  566K 1s
│   2250K .......... .......... .......... .......... .......... 85%  558K 1s
│   2300K .......... .......... .......... .......... .......... 87%  556K 1s
│   2350K .......... .......... .......... .......... .......... 88%  565K 1s
│   2400K .......... .......... .......... .......... .......... 90%  557K 1s
│   2450K .......... .......... .......... .......... .......... 92% 11.1M 0s
│   2500K .......... .......... .......... .......... .......... 94%  562K 0s
│   2550K .......... .......... .......... .......... .......... 96%  569K 0s
│   2600K .......... .......... .......... .......... .......... 98%  559K 0s
│   2650K .......... .......... .......... .......... ........  100% 10.5M=6.3s
│ 
│ 2024-01-28 15:51:43 (428 KB/s) - '7zz' saved [2763304/2763304]
│ 
│ 
│ 7-Zip (z) 23.01 (x64) : Copyright (c) 1999-2023 Igor Pavlov : 2023-06-20
│  64-bit locale=C.UTF-8 Threads:16 OPEN_MAX:1048576, ASM
│ 
│ 
│ 
│ Command Line Error:
│ Unsupported command:
│ python.zip
│ 
│ 7-Zip (z) 23.01 (x64) : Copyright (c) 1999-2023 Igor Pavlov : 2023-06-20
│  64-bit locale=C.UTF-8 Threads:16 OPEN_MAX:1048576, ASM
│ 
│ Scanning the drive for archives:
│ 
│ ERROR: errno=2 : No such file or directory
│ python.zip
│ 
│ 
│ 
│ System ERROR:
│ errno=2 : No such file or directory
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"707f7b488444ad116b35c1b899b001739920a11d","Vars":{},"WorkflowName":"Deploy cases"} -->